rprinz08/Walkino/hardware/walkera/xmega/variants/rx2634h/pins_arduino.h
#define PORTD_INT0					        0
#define PORTD_INT1					        1
#define PORTC_INT0					        2
#define PORTC_INT1					        3
#define PORTE_INT0					        4
#define PORTE_INT1					        5
#define PORTA_INT0					        6
#define PORTA_INT1					        7
#define PORTB_INT0					        8
#define PORTB_INT1					        9
#define PORTR_INT0					        10
#define PORTR_INT1					        11

// defined here instead of wiring_private.h
#define EXTERNAL_NUM_INTERRUPTS		  12

// was in wiring_external.h, moved here
#define EXTERNAL_INT_0				      0
#define EXTERNAL_INT_1				      1
#define EXTERNAL_INT_2				      2
#define EXTERNAL_INT_3				      3
#define EXTERNAL_INT_4				      4
#define EXTERNAL_INT_5				      5
#define EXTERNAL_INT_6				      6
#define EXTERNAL_INT_7				      7
#define EXTERNAL_INT_8				      8
#define EXTERNAL_INT_9				      9
#define EXTERNAL_INT_10				      10
#define EXTERNAL_INT_11				      11


// xmega 'A' series has 2 sets of UART and SPI.
// The default UART is assigned on Port E, pins PE2-3
// The default SPI is assigned on Port C, pins PC4-7
//
// Standard GPIO pins are assigned as follows:
//
// PD0-7 Digital 0-7
// PC0-7 Digital 8-15
// PE0-3 Digital 16-19
//
// PA0-7 analog A0-A7
// PB0-3 analog A8-A11
//
// ALL PORT REMAP registers must be assigned to 0 (default mappings for pins)
// this puts PWM output on pins 0-3 for PORT E (the timers are split for C and D)
// Additionally, CLKOUT should be 0 (no clock outputs on any port/pin).
//
// TIMERS
// Timer TC4 should be configured as 'TC5' (for 8 PWM outputs) by default, essentially
// as a dual 8-bit timer, more or less compatible with the Arduino's 3 timers and
// supporting all 8 pins on port C for PWM output.  Port C's timer supports
// the system clock. Port D's timer has only PD5, so only pins 4-7 can be used for
// PWM output.  TD5 won't remap the pins at all to 0-4.
//
// See 'E' manual (chapter 13?) on TC4/5 and TD5 for more on this


// --------------------------------------------
// DEFINITIONS FOR SERIAL PORTS AND DEFAULT TWI
// --------------------------------------------

#define DEFAULT_TWI					        TWIE
#define DEFAULT_SPI					        SPIC
#define SPI_PORT                    SPIC

// serial port 0
#define SERIAL_0_PORT_NAME			    PORTE
#define SERIAL_0_USART_NAME			    USARTE0
#define SERIAL_0_USART_DATA			    USARTE0_DATA
#define SERIAL_0_RXC_ISR			      ISR(USARTE0_RXC_vect)
#define SERIAL_0_DRE_ISR			      ISR(USARTE0_DRE_vect)
// the pin number on the port, not the mapped digital pin number
#define SERIAL_0_RX_PIN_INDEX		    2
// the pin number on the port, not the mapped digital pin number
#define SERIAL_0_TX_PIN_INDEX		    3
#define USARTE0_VECTOR_EXISTS


// For atmega/Arduino Uno shield compatibility, with DIGITAL_IO_PIN_SHIFT defined,
// the typical board/pin layout might be like this (for shield pins):
//
// TWI is on TWIC (port C pins 0/1).  pins marked as '~' have PWM
//
//               M M
//             S I O   T R
//         A   C S S S x x
//     S S R G K O I S 2 2              T R
//     C D E N 1 1 1 1                  x x
//     L A F D 3 2 1 0 9 8  7 6 5 4 3 2 1 0
// ----o-o-o-o-o-o-o-o-o-o--o-o-o-o-o-o-o-o----
//     P P P   P P P P P P  P P P P P P P P
//     C C A   C C C C C C  D D D D D D D D
//     1 0 0   5 6 7 4 3 2  1 7 6 5 4 0 3 2
//     ~ ~     ~ ~ ~ ~ ~ ~    ~ ~ ~ ~
//
//               T O P   V I E W
//
//                           p
//               3   3       w  P P P P P P
//               V   V 5     r  A A A A A A
//               3   3 V     +  6 5 4 3 2 1
// ------------o-o-o-o-o-o-o-o--o-o-o-o-o-o----
//             U I R 3 5 G G V  A A A A A A
//             N O E . V N N i  5 4 3 2 1 0
//             U R S 3   D D n
//             S E E V
//             E F T
//             D
//
// RESERVED PINS (not brought out):  PA7, PR0, PD4 (connected to LED_BUILTIN)
//
// ARef should have a 100 ohm (or similar) resistor to Vcc with a decoupling capacitor
// IOREF must be connected to 3.3V so that compatible shields can detect 3.3V logic
// Vin connects to the 'power in' pin (may have 9V or more on this pin)
// 5V can be left unconnected, or use a separate voltage reg for 5V
// 3.3v must be regulated and able to supply 1A or more for shields.
//
// NOTE:  PA0 is connected to 'AREF', and PORTA pins are shifted to PA1 through PA6 for
//        A0 through A5.
//
// Uno has automatic switching between 5V reg out and 5V from USB power.  When Vin is more
// than 6.6v, the Vin source supplies 5V (and 3.3V) to the board.  otherwise, the USB
// 5V power supplies 5V (and 3.3V) to the board.
//
// NOTE:  on the E5, PC7 is MOSI, PC5 is SCK (it's the other way on the other CPUs)
//
// Summary Map:  D0   D1   D2   D3   D4   D5   D6   D7   D8   D9   D10  D11  D12  D13
//               PD2  PD3  PD0  PD4  PD5  PD6  PD7  PD1  PC2  PC3  PC4  PC7  PC6  PC5
//               Rx   Tx                                 Rx2  Tx2  SS   MOSI MISO SCK
//
//               A0   A1   A2   A3   A4   A5
//               PA1  PA2  PA3  PA4  PA5  PA6
//
// TWIC:  PC0 (SDA), PC1 (SCL)
// AREF:  PA0 (~10k to Vcc)
//
// ASYNC INTERRUPTS:  A1, D0, D8 (can be used for 'wakeup')
//

// default SPI
static const uint8_t SS   = 12;
static const uint8_t MOSI = 13;
static const uint8_t MISO = 14;
static const uint8_t SCK  = 15;

// primary SPI on PC4-7
static const uint8_t SS0   = 12;
static const uint8_t MOSI0 = 13;
static const uint8_t MISO0 = 14;
static const uint8_t SCK0  = 15;

// secondary SPI on PD4-7
static const uint8_t SS1   = 4;
static const uint8_t MOSI1 = 5;
static const uint8_t MISO1 = 6;
static const uint8_t SCK1  = 7;

// default 2-wire on PC0,PC1 - TWIC
static const uint8_t SDA = 8;
static const uint8_t SCL = 9;

// default 'status' LED on PD7
static const uint8_t LED_BUILTIN = 7;

// analog ports
static const uint8_t A0 = 20;
static const uint8_t A1 = 21;
static const uint8_t A2 = 22;
static const uint8_t A3 = 23;
static const uint8_t A4 = 24;
static const uint8_t A5 = 25;
static const uint8_t A6 = 26;
static const uint8_t A7 = 27;

static const uint8_t A8 = 28;
static const uint8_t A9 = 29;
static const uint8_t A10 = 30;
static const uint8_t A11 = 31;

// on the xmega 'E' series, PA2, PC2, and PD2 are asynchronous ints.  Others
// are 'synchronous' which means that they must be held in their
// 'interrupt state' long enough for the system to detect them. In any case
// all digital input pins can be use as interrupts, synchronous or otherwise.


#ifdef ARDUINO_MAIN

const uint16_t PROGMEM port_to_mode_PGM[] = {
  NOT_A_PORT,                  // 0
  (uint16_t) &PORTA_DIR,       // PA
  (uint16_t) &PORTB_DIR,       // PB
  (uint16_t) &PORTC_DIR,       // PC
  (uint16_t) &PORTD_DIR,       // PD
  (uint16_t) &PORTE_DIR,       // PE
  NOT_A_PORT,                  // A series has no 'port R'
};

const uint16_t PROGMEM port_to_output_PGM[] = {
  NOT_A_PORT,                  // 0
  (uint16_t) &PORTA_OUT,       // PA
  (uint16_t) &PORTB_OUT,       // PB
  (uint16_t) &PORTC_OUT,       // PC
  (uint16_t) &PORTD_OUT,       // PD
  (uint16_t) &PORTE_OUT,       // PE
  NOT_A_PORT,                  // A series has no 'port R'
};

const uint16_t PROGMEM port_to_input_PGM[] = {
  NOT_A_PORT,                  // 0
  (uint16_t) &PORTA_IN,        // PA
  (uint16_t) &PORTB_IN,        // PB
  (uint16_t) &PORTC_IN,        // PC
  (uint16_t) &PORTD_IN,        // PD
  (uint16_t) &PORTE_IN,        // PE
  NOT_A_PORT,                  // A series has no 'port R'
};

